zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_PLL_DIG.h
/*! @name PLL_DATARATE_CTRL - PLL Data Rate Switch Control */
/*! @{ */

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_TX_DRS_MASK (0x7U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_TX_DRS_SHIFT (0U)
/*! HPM_VCM_TX_DRS - Data Rate Switch for hpm_vcm_tx
 *  0b000..432 mV
 *  0b001..328 mV
 *  0b010..456 mV
 *  0b011..473 mV
 *  0b100..488 mV
 *  0b101..408 mV
 *  0b110..392 mV
 *  0b111..376 mV
 */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_TX_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_TX_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_TX_DRS_MASK)

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_CAL_DRS_MASK (0x70U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_CAL_DRS_SHIFT (4U)
/*! HPM_VCM_CAL_DRS - Data Rate Switch for hpm_vcm_cal
 *  0b000..432 mV
 *  0b001..328 mV
 *  0b010..456 mV
 *  0b011..473 mV
 *  0b100..488 mV
 *  0b101..408 mV
 *  0b110..392 mV
 *  0b111..376 mV
 */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_CAL_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_CAL_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_VCM_CAL_DRS_MASK)

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_TX_DRS_MASK (0x700U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_TX_DRS_SHIFT (8U)
/*! PLL_VCO_TRIM_KVM_TX_DRS - Data Rate Switch for pll_vco_trim_kvm_tx.
 *  0b000..10MHz/V
 *  0b100..20MHz/V
 *  0b110..30MHz/V
 *  0b111..40MHz/V
 */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_TX_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_TX_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_TX_DRS_MASK)

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_CAL_DRS_MASK (0x7000U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_CAL_DRS_SHIFT (12U)
/*! PLL_VCO_TRIM_KVM_CAL_DRS - Data Rate Switch for pll_vco_trim_kvm_cal
 *  0b000..10MHz/V
 *  0b100..20MHz/V
 *  0b110..30MHz/V
 *  0b111..40MHz/V
 */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_CAL_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_CAL_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_PLL_VCO_TRIM_KVM_CAL_DRS_MASK)

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_LPM_SDM_DELAY_DRS_MASK (0xF0000U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_LPM_SDM_DELAY_DRS_SHIFT (16U)
/*! LPM_SDM_DELAY_DRS - DRS LPM_SDM_DELAY */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_LPM_SDM_DELAY_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_LPM_SDM_DELAY_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_LPM_SDM_DELAY_DRS_MASK)

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_SDM_DELAY_DRS_MASK (0xF00000U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_SDM_DELAY_DRS_SHIFT (20U)
/*! HPM_SDM_DELAY_DRS - DRS HPM_SDM_DELAY */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_SDM_DELAY_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_SDM_DELAY_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_SDM_DELAY_DRS_MASK)

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_INTEGER_DELAY_DRS_MASK (0xF000000U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_INTEGER_DELAY_DRS_SHIFT (24U)
/*! HPM_INTEGER_DELAY_DRS - DRS HPM_SDM_DELAY */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_INTEGER_DELAY_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_INTEGER_DELAY_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_INTEGER_DELAY_DRS_MASK)

#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_COUNT_ADJUST_DRS_MASK (0xF0000000U)
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_COUNT_ADJUST_DRS_SHIFT (28U)
/*! HPM_COUNT_ADJUST_DRS - HPM_COUNT_ADJUST_DRS */
#define XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_COUNT_ADJUST_DRS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_COUNT_ADJUST_DRS_SHIFT)) & XCVR_PLL_DIG_PLL_DATARATE_CTRL_HPM_COUNT_ADJUST_DRS_MASK)
/*! @} */

/*! @name PLL_PHASE_COMPENSATION - PLL phase compensation */
/*! @{ */

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_MASK (0x3U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_SHIFT (0U)
/*! EN_INPR - Enable for feature Inline phase return ranging */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_RX_NORM_MASK (0x4U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_RX_NORM_SHIFT (2U)
/*! EN_INPR_RX_NORM - Enable for Inline phase return feature, rx_norm contribution */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_RX_NORM(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_RX_NORM_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_INPR_RX_NORM_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_COMP_INV_MASK (0x8U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_COMP_INV_SHIFT (3U)
/*! RX_COMP_INV - Rx phase compensation inversion */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_COMP_INV(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_COMP_INV_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_COMP_INV_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_DT_MASK (0x30U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_DT_SHIFT (4U)
/*! INPR_DT - Inline phase return ranging integration period
 *  0b00..4 SDM clock cycles, 0.0625us
 *  0b01..8 SDM clock cycles, 0.125us
 *  0b10..16 SDM clock cycles, 0.25us
 *  0b11..32 SDM clock cycles, 0.5us
 */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_DT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_DT_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_DT_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_CORR_INV_MASK (0x40U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_CORR_INV_SHIFT (6U)
/*! INPR_CORR_INV - INPR_CORR_INV */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_CORR_INV(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_CORR_INV_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_CORR_INV_MASK)

