zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_PLL_DIG.h
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_TQI_DIS_MASK (0x80U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_TQI_DIS_SHIFT (7U)
/*! INPR_TX_TQI_DIS - INPR_TX_TQI_DIS */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_TQI_DIS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_TQI_DIS_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_TQI_DIS_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_START_TUNING_MASK (0x3F00U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_START_TUNING_SHIFT (8U)
/*! INPR_START_TUNING - Fine phase shift start for inline phase return */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_START_TUNING(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_START_TUNING_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_START_TUNING_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_T_EXT_TQI_EN_MASK (0x4000U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_T_EXT_TQI_EN_SHIFT (14U)
/*! INPR_TX_T_EXT_TQI_EN - INPR_TX_T_EXT_TQI_EN */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_T_EXT_TQI_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_T_EXT_TQI_EN_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_T_EXT_TQI_EN_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_PA_PUP_TQI_EN_MASK (0x8000U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_PA_PUP_TQI_EN_SHIFT (15U)
/*! INPR_TX_PA_PUP_TQI_EN - INPR_TX_PA_PUP_TQI_EN */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_PA_PUP_TQI_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_PA_PUP_TQI_EN_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_INPR_TX_PA_PUP_TQI_EN_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_PLL_PHASE_SHIFT_MASK (0x30000U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_PLL_PHASE_SHIFT_SHIFT (16U)
/*! EN_PLL_PHASE_SHIFT - PLL phase shift */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_PLL_PHASE_SHIFT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_PLL_PHASE_SHIFT_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_EN_PLL_PHASE_SHIFT_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_DT_MASK (0xC0000U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_DT_SHIFT (18U)
/*! RX_PHASE_COMP_DT - RX compensation phase integration period
 *  0b00..4 SDM clock cycles, 0.0625us
 *  0b01..8 SDM clock cycles, 0.125us
 *  0b10..16 SDM clock cycles, 0.25us
 *  0b11..32 SDM clock cycles, 0.5us
 */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_DT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_DT_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_DT_MASK)

#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_START_TUNING_MASK (0x3F00000U)
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_START_TUNING_SHIFT (20U)
/*! RX_PHASE_COMP_START_TUNING - Fine phase shift start for RX phase compensation */
#define XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_START_TUNING(x) (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_START_TUNING_SHIFT)) & XCVR_PLL_DIG_PLL_PHASE_COMPENSATION_RX_PHASE_COMP_START_TUNING_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_PLL_DIG_Register_Masks */


/*!
 * @}
 */ /* end of group XCVR_PLL_DIG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_XCVR_PLL_DIG_H_ */

